In [1]:
import pandas as pd

 - PassengerId: Id of every passenger
 - Survived: This feature have value 0 and 1. 0 fro not suvirved and 1 for suvived
 - Pclass: Thre are 3 classes: Class1, Class 2 and Class 3
 - Name: Name of Passenger
 - Age: Age of passenger
 - SibSp: Indication that passenger have sibling and spouse
 - Parch: Whether a passenger is alone or have family
 - Ticket_: Ticket Number of passenger
 - Cabin: The cabin of passenger
 - Embarked: The Emabarked category

In [12]:
df_titanic =  pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### Aggregating Statisctics

In [14]:
# Average of the titacnic passengers
df_titanic['Age'].mean()

29.69911764705882

In [16]:
#Median of age and Fare
df_titanic[['Age','Fare']].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [18]:
# Aggregatin statistic can eb calculated for mulitple columns at the same time.
df_titanic[['Age','Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [19]:
# Instead of the predefined statistic, specific combinatioinjs of aggregating statistic for given columns can be defined using th datafme.agg() method:
df_titanic.agg(
    {
        'Age': ["min","max","median","skew"],
        'Fare': ['min',"max","median","mean"]
    }
)

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
skew     0.389108         NaN
mean          NaN   32.204208

In [22]:
# Average age for male versus female titanic passengers
df_titanic[['Sex','Age']].groupby('Sex').mean()

              Age
Sex
female  27.915709
male    30.726645

#### Groupby

In [23]:
df_titanic.groupby("Sex")['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [24]:
df_titanic.groupby(['Sex','Pclass'])['Fare'].mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

#### Counter numbers category

In [28]:
df_titanic['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [29]:
df_titanic['Pclass'].value_counts().sort_index()

1    216
2    184
3    491
Name: Pclass, dtype: int64

In [31]:
df_titanic.groupby('Pclass')['Pclass'].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

Reshape Layout of Tables

In [33]:
df_titanic.sort_values(by="Age", ascending=False).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q